增加同步并发和异步机制文档
Signed-off-by: Mengliang.Huang <hml1006@qq.com>
